{   "name":"Claire",
    "headerTaglineOne":"I'm Claire Weissman",
    "headerTaglineTwo":"Software engineer/Machine Learning Engineer",
    "headerTaglineThree": "based in the Seattle Area",
    "headerTaglineFour": "Open to in-person and remote work and relocation",
    "showCursor":false,
    "showBlog":false,
    "darkMode":true,
    "showResume":true,
    "socials":
        [{"id":"1","title":"Github","link":"https://github.com/cweissman001        "},
        {"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/claire-weissman2001/"},
        {"id":"5","title":"Email","link":"mailto:claire.weissman@gmail.com"}],
    "projects":
        [{"id":"1","title":"Team Scheduler Application","description":"Web Development project for University Capstone Project","url":"https://youtu.be/ok2NB8w1RKY"},
        {"id":"2","title":"Deep Learning Uncertainty Metric Creation","description":"Deep Learning/Data Science Research Project at Depaul University","url":"https://dl.acm.org/doi/abs/10.1145/3477314.3507232?casa_token=-OhcyD1Fp4QAAAAA:J_OhUPI_KHqDMdarYIcY4CPOHMmh0AUHbyjuZmtX2v3czZddLsXXfNFkydgAxy9S2XEIzSLkuBSU"},
        {"id":"3","title":"Automatic Legend Generation","description":"Web Design Project creating legends for Virtual Reality Visualizations","url":"https://www.youtube.com/watch?v=WcjAFzMsry4"}],

    "aboutpara":
        "Software engineer bringing experience in full stack development and Machine Learning. Experience on both front-end and back-end projects using both Rust and Go and as a Machine Learning Engineer using Python. Researcher on data science and machine learning project. Team member who excels in coordination and strives to contribute to work projects and communicate clearly.",
    "resume":
        {"tagline":"Software engineer and Machine Learning Engineer",
        "description": "I love to dig into challenging coding problems. Since I first coded(my junior year in high school), I have loved solving problems elegantly and creatively. The more I learned about computer science, the more excited I was to work in the field. I have a unique background in research and industry experience. I was an NSF student researcher at DePaul University, where I created a novel uncertainty metric for deep neural networks that determines the difficulty of classifying images for cancer diagnosis. I published two papers at prestigious conferences and received two best poster awards. I am eager to learn new technologies and explore new domains in ML. My specialties include Python, Go, Python ml libraries, Git/Github, data structures, algorithms, and quickly learning new programming languages and techniques. I am always ready to jump into a new problem!",
        "experiences":
            [{"id":"1","dates":"April 2024 - July 2024","type":"Full-Time","position":"Machine Learning Engineer at HiddenLayer","bullets":"Expanded machine learning model database to allow for extensive testing and verification of internal code efficacy, Engineered Python machine-learning adversarial attacks to enhance model robustness and security and provide insight into typical ML model weaknesses and cybersecurity techniques to use to protect AI, Mentored and supervised a team of interns on machine learning projects and engineering best practices, Delivered a presentation on adversarial AI at BSides Seattle 2024."},
            {"id":"2","dates":"June 2022 - August 2022","type":"Full-Time","position":"Software Engineer at HiddenLayer","bullets":"Boosted product robustness by collaborating with team members to optimize and redirect API endpoints in Golang, Achieved 80% test coverage by devising and implementing comprehensive unit and integration tests, Crafted over 20 machine-learning models employing Python libraries such as TensorFlow, Keras, PyTorch, SkLearn, Onnx, and Pickle to enhance the accuracy, performance and design of the scanner product, Added 4 file-type scanners to analyze machine-learning files to increase coverage capabilities for customer-facing products"},
            {"id":"3","dates":"August 2022 - December 2022","type":"Internship","position":"Software Engineer at XetData","bullets": "Worked with a team of developers to contribute to the development of XetHub, a specialized version control application, Established interactive data visualizations for large datasets (TBs) utilizing Vega.js and advancing data analysis, Increased efficiency of classification and typing of repository contents in Rust"},
            {"id":"4","dates":"June 2022 - August 2022","type":"Internship","position":"Technology Development Intern at UnitedHealthGroup","bullets":"Hardened the big data Optum Clinical Manager application for deployment and use internally, Developed an automation testing suite using Cypress Cucumber Gherkin and JavaScript to create a testing pipeline for the company to use daily on vital employee facing software."},
            {"id":"5","dates":"June 2021 - August 2022","type":"Research","position":"NSF Machine Learning Researcher at DePaul University","bullets": "Developed a novel uncertainty metric for neural networks to assess image classification complexity in cancer diagnosis, Conducted in-depth analysis of extensive datasets to identify optimal machine-learning methodologies, Presented research on similarity-based uncertainty scores for computer-aided diagnosis at SPIE Medical Imaging Conference 2022, resulting in receiving the Best Computer-Aided Diagnosis Poster award, Presented research paper on Similarity-Based Uncertainty Scores for Interpretable Deep Learning in Scientific Applications at SAC-SRC 2022"},
            {"id":"6","dates":"May 2021 - October 2022","type":"Community Engagement","position":"Executive Leader for Professtional Development","bullets":"Responsible for promoting the importance of community engagement and volunteering to encourage and increase volunteering and connection in the Whitman College community, Trained staff members on how to represent community engagement properly on a resume and verbally to help better prepare colleagues for a career post college"},
            {"id":"7","dates":"May 2020 - October 2020","type":"Research","position":"NSF Graphics Researcher at Universoty of Minnesota","bullets":"Contributed significantly to the Sculpting Visualizations project utilizing VR technology to improve data visualization, Devised and implemented an automated web interface that streamlined the process of generating legends in Artifact Based Rendering software, Presented research findings at IEEE Vis 2020 leading to the publication of a paper on automating data legend creation for 3D multi-variate visualizations, Acknowledged with the Best Scientific Research Poster award."},
            {"id":"8","dates":"January 2021 - December 2021","type":"Teaching Assistant","position":"Computer Science Class Mentor","bullets":"Conducted weekly office hours to review material and questions with students.Hosted comprehensive review sessions before every exam according to study guides and professor instructions to better prepare students."}],
        "education":
            {"universityName":"Whitman College","universityDate":"2019-2023","universityPara":"Graduated from Whitman college Summa Cum Laude(3.9)"},
        "languages":
            ["Go", "Python", "Javascript","Java", "C++"],
        "frameworks":
            ["React","Typescript","NodeJs"]}
}